#+TITLE: Advent of Code 2024
#+SUBTITLE: Day 10: Hoof It
#+AUTHOR: Michael R. Mauger
#+DATE: [Tue Dec 10 19:20:27 EST 2024]
#+STARTUP: showeverything inlineimages
#+OPTIONS: toc:nil
#+OPTIONS: ^:{}
#+OPTIONS: num:nil

#+AUTO_TANGLE: t
#+PROPERTY: header-args    :tangle no
#+PROPERTY: header-args    :noweb no-export

* Execution

#+BEGIN_SRC bash :results output
  LOAD_FILE=example.dat sqlite3 :memory: < hoof-it.sql
  LOAD_FILE=input.dat   sqlite3 :memory: < hoof-it.sql
#+END_SRC

#+RESULTS:
#+begin_example
Run Time: real 0.000 user 0.000159 sys 0.000000
changes: 0   total_changes: 0
Run Time: real 0.000 user 0.000063 sys 0.000000
changes: 0   total_changes: 0
Run Time: real 0.000 user 0.000077 sys 0.000000
changes: 64   total_changes: 72
┌─────────────────────────────────┐
│ Part One: Hoof It summit counts │
├─────────────────────────────────┤
│ 36                              │
└─────────────────────────────────┘
Run Time: real 0.001 user 0.001023 sys 0.000000
changes: 64   total_changes: 72
┌────────────────────────────────┐
│ Part Two: Hoof It trail rating │
├────────────────────────────────┤
│ 81                             │
└────────────────────────────────┘
Run Time: real 0.000 user 0.000892 sys 0.000000
changes: 64   total_changes: 72
Memory Used:                         84368 (max 424064) bytes
Number of Outstanding Allocations:   212 (max 488)
Number of Pcache Overflow Bytes:     21336 (max 50064) bytes
Largest Allocation:                  87360 bytes
Largest Pcache Allocation:           4368 bytes
Lookaside Slots Used:                51 (max 123)
Successful lookaside attempts:       3109
Lookaside failures due to size:      9
Lookaside failures due to OOM:       707
Pager Heap Usage:                    17960 bytes
Page cache hits:                     27
Page cache misses:                   0
Page cache writes:                   0
Page cache spills:                   0
Schema Heap Usage:                   1344 bytes
Statement Heap/Lookaside Usage:      0 bytes
Bytes received by read():            23820
Bytes sent to write():               1269
Read() system calls:                 40
Write() system calls:                6
Bytes read from storage:             0
Bytes written to storage:            0
Cancelled write bytes:               0
Run Time: real 0.001 user 0.000069 sys 0.000069
changes: 0   total_changes: 0
Run Time: real 0.000 user 0.000038 sys 0.000038
changes: 0   total_changes: 0
Run Time: real 0.001 user 0.000984 sys 0.000000
changes: 3364   total_changes: 3422
┌─────────────────────────────────┐
│ Part One: Hoof It summit counts │
├─────────────────────────────────┤
│ 760                             │
└─────────────────────────────────┘
Run Time: real 0.243 user 0.240559 sys 0.000967
changes: 3364   total_changes: 3422
┌────────────────────────────────┐
│ Part Two: Hoof It trail rating │
├────────────────────────────────┤
│ 1764                           │
└────────────────────────────────┘
Run Time: real 0.243 user 0.242055 sys 0.000001
changes: 3364   total_changes: 3422
Memory Used:                         128128 (max 910088) bytes
Number of Outstanding Allocations:   222 (max 498)
Number of Pcache Overflow Bytes:     65096 (max 277616) bytes
Largest Allocation:                  262144 bytes
Largest Pcache Allocation:           4368 bytes
Lookaside Slots Used:                51 (max 123)
Successful lookaside attempts:       82787
Lookaside failures due to size:      9
Lookaside failures due to OOM:       707
Pager Heap Usage:                    61480 bytes
Page cache hits:                     126
Page cache misses:                   0
Page cache writes:                   0
Page cache spills:                   0
Schema Heap Usage:                   1344 bytes
Statement Heap/Lookaside Usage:      0 bytes
Bytes received by read():            30668
Bytes sent to write():               4779
Read() system calls:                 40
Write() system calls:                6
Bytes read from storage:             0
Bytes written to storage:            0
Cancelled write bytes:               0
#+end_example
